In [10]:
import duckdb
import time
import pandas as pd

In [3]:
path = './data/ecommerce/2019-Oct.csv'

In [9]:
t0 = time.time()
df = duckdb.sql("SELECT user_id, min(event_time), max(event_time), count(distinct(product_id)), sum(price) FROM './data/ecommerce/2019-Oct.csv' GROUP BY user_id").df()
t1 = time.time()
print(t1 - t0)

34.35550403594971

In [11]:
df.shape

(3022290, 5)

In [12]:
df.tail()

,user_id,min(event_time),max(event_time),count(DISTINCT product_id),sum(price)
3022285,555427940,2019-10-31 20:41:49,2019-10-31 20:41:49,1,52.77
3022286,531349974,2019-10-31 20:41:51,2019-10-31 20:41:51,1,7.18
3022287,566252498,2019-10-31 20:41:57,2019-10-31 20:41:57,1,462.79
3022288,552968800,2019-10-31 20:42:03,2019-10-31 20:42:20,1,2464.34
3022289,566252467,2019-10-31 20:42:09,2019-10-31 20:42:09,1,949.47

In [13]:
df['count(DISTINCT product_id)'].value_counts()

count(DISTINCT product_id)
1       992641
2       416297
3       264008
4       194935
5       149342
         ...
471          1
1148         1
420          1
439          1
526          1
Name: count, Length: 504, dtype: int64

In [15]:
df[df['count(DISTINCT product_id)'] > 10]

,user_id,min(event_time),max(event_time),count(DISTINCT product_id),sum(price)
0,519107250,2019-10-01 00:00:01,2019-10-01 09:49:46,15,9521.53
1,535871217,2019-10-01 00:00:04,2019-10-28 15:00:59,29,36328.88
2,512742880,2019-10-01 00:00:05,2019-10-26 14:20:07,22,42558.08
5,519530528,2019-10-01 00:00:23,2019-10-26 13:40:00,59,23617.22
10,512558158,2019-10-01 00:00:36,2019-10-31 08:23:48,43,32742.52
...,...,...,...,...,...
3021937,538488716,2019-10-31 19:40:39,2019-10-31 19:57:32,20,24993.21
3021940,543602972,2019-10-31 19:41:00,2019-10-31 19:52:57,14,24159.61
3021962,566239343,2019-10-31 19:44:12,2019-10-31 19:50:24,12,2027.39
3022128,524140122,2019-10-31 20:16:29,2019-10-31 20:38:46,13,3762.34
3022159,557782985,2019-10-31 20:19:41,2019-10-31 20:36:54,11,1056.20